#+TITLE:        DevSecOps Assessment
#+SUBTITLE:     Quick reference card
#+AUTHOR:       Uzair Qamar
#+EMAIL:        uzairqamarxyz@gmail.com
#+DESCRIPTION:  DevSecOps Assessment Task
#+KEYWORDS:     kubernetes, helm, kubeadm, python, flask, pytest, cicd
#+LANGUAGE:     en


*** Install Calico
https://docs.tigera.io/calico/latest/getting-started/kubernetes/self-managed-onprem/onpremises
1. Add this to NetworkManager configuration file.
#+begin_src
# /etc/NetworkManager/conf.d/calico.conf
[keyfile]
unmanaged-devices=interface-name:cali*;interface-name:tunl*;interface-name:vxlan.calico;interface-name:vxlan-v6.calico;interface-name:wireguard.cali;interface-name:wg-v6.cali
#+end_src
1. Install Tigera Operator
#+begin_src shell
helm repo add projectcalico https://docs.tigera.io/calico/charts
helm install calico projectcalico/tigera-operator --version v3.30.3 --namespace tigera-operator --create-namespace
#+end_src

#+RESULTS:
| projectcalico already exists with the same configuration | skipping |

2. Watch the status of the calico pods
#+begin_src shell
watch kubectl get pods -n calico-system
#+end_src

3. If the pods are stuck in "ContainerCreating" or "Pending". Make sure the =calico= & =calico-ipam= binaries are also in =/usr/lib/cni/=
#+begin_src shell
sudo cp /opt/cni/bin/calico /opt/cni/bin/calico-ipam /usr/lib/cni/
#+end_src

